[
{"title": "X (2002) - full transcript", "plot": null, "url": "https://subslikescript.com/movie/X-326430"},
{"title": "X-Deal (2011) - full transcript", "plot": "Photographer Billy and his girlfriend Sarah have just moved into a new apartment. They are no longer in love, but they content themselves with sex, often involving role play. Billy becomes enamored with their new neighbor Dana, who spends her days at home blogging and supplying drugs to a local dealer. The thing is, Dana's more attracted to Sarah. Billy lays out a deal: Dana can spend the night with Sarah, and in exchange, he gets to have sex with her. Billy manipulates the two ladies to get what he wants, but he fails to realize the risk of the arrangement.", "url": "https://subslikescript.com/movie/X-Deal-2049597"},
{"title": "X (1996) - full transcript", "plot": "The story takes place in 1999, the Year of Destiny, and the beginning of the end of the world. The future of the universe rests on one young man, Kamui Shiro, who must destroy either the ...", "url": "https://subslikescript.com/movie/X-118200"},
{"title": "X-Men (2000) - full transcript", "plot": "In a world where both Mutants and Humans fear each other, Marie, better known as Rogue, runs away from home and hitches a ride with another mutant, known as Logan, a.k.a. Wolverine. Charles Xavier, who owns a school for young mutants, sends Storm and Cyclops to bring them back before it is too late. Magneto, who believes a war is approaching, has an evil plan in mind, and needs young Rogue to help him.", "url": "https://subslikescript.com/movie/X-Men-120903"},
{"title": "X Men Origins: Wolverine T4 Movie Special (2009) - full transcript", "plot": null, "url": "https://subslikescript.com/movie/X_Men_Origins_Wolverine_T4_Movie_Special-1423570"},
{"title": "X (2022) - full transcript", "plot": "Set in 1979, adult movie actors and a small film crew arrive to a farmhouse occupied by an elderly couple in the desolate Texas countryside to film an adult movie. As the day shifts to night, the visitors slowly realize that they are not safe, and are being targeted by a nearby enemy.", "url": "https://subslikescript.com/movie/X-13560574"},
{"title": "X the Unknown (1956) - full transcript", "plot": "British Army radiation drills at a remote Scottish base attract a subterranean, radioactive entity of unknown nature that vanishes, leaving two severely radiation-burned soldiers... and a \"bottomless\" crack in the earth. Others who meet the thing in the night suffer likewise, and with increasing severity; it seems to be able to \"absorb\" radiation from any source, growing bigger and bigger. What is it?? How do you destroy a thing that \"feeds\" on energy?", "url": "https://subslikescript.com/movie/X_the_Unknown-49967"},
{"title": "X - The eXploited (2018) - full transcript", "plot": "Would you believe in a policewoman who suffers from such serious panic disorders that she is afraid to get close to any crime scene and has been on permanent office duty for more than a decade? Would you believe a lone mother who is unfit to pay her mortgage and also raise her rebellious teenage daughter? Indeed, no one believes that the troubled ex-detective has discovered a serial murder case. Personal dramas and a murder mystery unfold in present-day Budapest, where demonstrations are part of the pre-election life of a city still trying to cope with the shadows of its historical and recent past. It is a city where nothing seems honest and true, except through the eyes of an emotionally unstable policewoman and her misfit daughter who wants to know who her father truly was.", "url": "https://subslikescript.com/movie/X_-_The_eXploited-6190456"},
{"title": "X (2021) - full transcript", "plot": "A brief encounter causes one man to reflect on the monumental impact that an 'ex' has had on his life...but can the man rediscover his once sentimental soul and reconnect with the notion that \"all you need is love\"?", "url": "https://subslikescript.com/movie/X-13262868"},
{"title": "X Moor (2014) - full transcript", "plot": "A pair of documentarians head into the woods of the Exmoor countryside to find proof of the mysterious big cats that roam the area. But what they find in the depths of the forest is a horror beyond imagine. They must fight tooth and nail to survive or fall prey to what lurks in the darkness.", "url": "https://subslikescript.com/movie/X_Moor-3293138"},
{"title": "X-Men Origins: Wolverine (2009) - full transcript", "plot": "Two mutant brothers, Logan and Victor, born 200 years ago, suffer childhood trauma and have only each other to depend on. Basically, they're fighters and killers, living from war to war through U.S. history. In modern times, a U.S. colonel, Stryker, recruits them and other mutants as commandos. Logan quits and becomes a logger, falling in love with a local teacher. When Logan refuses to rejoin Stryker's crew, the colonel sends the murderous Victor. Logan now wants revenge.", "url": "https://subslikescript.com/movie/X-Men_Origins_Wolverine-458525"},
{"title": "X-Men 2 (2003) - full transcript", "plot": "Several months have passed since The X-Men defeated Magneto and imprisoned him in a seemingly impregnable plastic chamber. One day, a mutant by the name of Nightcrawler infiltrates the White House and attempts to assassinate the president, setting off a chain reaction of anti-mutant measures by the government. Meanwhile, Logan is trying to discover his past. As scientist named William Stryker discovers Professor X's secret school and Cerebro, Magneto's partner, Mystique, is planning to break her leader out of prison. But when Professor X's school is attacked by Stryker's forces, Logan, Rogue, Iceman and a few are lucky to escape. Those who remain meet in Boston, where they form an uneasy alliance with Magneto to stop Stryker and rescue Professor X.", "url": "https://subslikescript.com/movie/X-Men_2-290334"},
{"title": "X-Men: Apocalypse (2016) - full transcript", "plot": "Since the dawn of civilization, he was worshiped as a god. Apocalypse, the first and most powerful mutant from Marvel's X-Men universe, amassed the powers of many other mutants, becoming immortal and invincible. Upon awakening after thousands of years, he is disillusioned with the world as he finds it and recruits a team of powerful mutants, including a disheartened Magneto, to cleanse mankind and create a new world order, over which he will reign. As the fate of the Earth hangs in the balance, Raven with the help of Professor X must lead a team of young X-Men to stop their greatest nemesis and save mankind from complete destruction.", "url": "https://subslikescript.com/movie/X-Men_Apocalypse-3385516"},
{"title": "X-Men: Dark Phoenix (2019) - full transcript", "plot": "Jean Grey begins to develop incredible powers that corrupt and turn her into a Dark Phoenix, causing the X-Men to decide if her life is worth more than all of humanity.", "url": "https://subslikescript.com/movie/X-Men_Dark_Phoenix-6565702"},
{"title": "X-Men: First Class (2011) - full transcript", "plot": "Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their powers for the first time. Before they were archenemies, they were closest of friends, working together, with other Mutants (some familiar, some new), to stop the greatest threat the world has ever known. In the process, a rift between them opened, which began the eternal war between Magneto's Brotherhood and Professor X's X-MEN.", "url": "https://subslikescript.com/movie/X-Men_First_Class-1270798"},
{"title": "X-Men: Days of Future Past (2014) - full transcript", "plot": "In the future, the mutants and the humans that help them are slaughtered by powerful robots named Sentinels. Professor Xavier, Wolverine, Magneto, Storm, Kitty Pryde and her friends meet at a monastery in China and Xavier explains that the invincible Sentinels were created using the DNA of Mystique that was captured in 1973 when she tried to assassinate their creator Dr. Bolivar Trask. Xavier tells that their only chance is return to 1973 using Pryde's ability to join Charles Xavier and Erik Lehnsherr to convince Mystique to give up of her intention. . However, only Wolverine can withstand the damages of the time travel. Will he succeed in stopping Mystique and the Sentinel Program and save the mutants and their human friends from annihilation?", "url": "https://subslikescript.com/movie/X-Men_Days_of_Future_Past-1877832"},
{"title": "Xenophobia (2019) - full transcript", "plot": "Six complete strangers recall the details of their individual experiences with alien forces-sharing the terrifying stories of their abductions and possessions.", "url": "https://subslikescript.com/movie/Xenophobia-8571404"},
{"title": "Xenia (2014) - full transcript", "plot": "Strangers in their own birthplace, 16-year-old Danny and 18-year-old Odysseus cross the entire country in search of their Greek father, after their Albanian mother passes away. Determined to force him to acknowledge paternity, little do they know that the road to the much-coveted Greek citizenship is paved with ghosts from the past, adult savagery and a dream that needs to come true, no matter what. Reaching the end of this initiatory journey they eventually come of age even if Greece refuses to follow.", "url": "https://subslikescript.com/movie/Xenia-3186946"}
]